app/controllers/dashboard_controller.rb

  def put_potential_contractors

    potentialcontractors = Contractor.where(available_now: true)
    potentialcontractors.each do |contractor|
      jobsearch = Jobsearch.where(contractor_id: contractor.id, job_id: params[:job_id]).first_or_create
      relationship = Relationship.where(contractor_id: contractor.id, company_id: params[:company_id]).first_or_create
---
SELECT  "jobsearches".* FROM "jobsearches"  WHERE "jobsearches"."contractor_id" = 2 AND "jobsearches"."job_id" = 2 LIMIT 1
SELECT  "jobsearches".* FROM "jobsearches"  WHERE "jobsearches"."contractor_id" = 2 AND "jobsearches"."job_id" IS NULL LIMIT 1
SELECT  "relationships".* FROM "relationships"  WHERE "relationships"."contractor_id" = 2 AND "relationships"."company_id" = 1 LIMIT 1

  def show_job_interest

    jobsearch = Jobsearch.where(contractor_id: params[:contractor_id], job_id: params[:job_id]).first_or_create

    jobsearch.interested ? (jobsearch.interested = false) : (jobsearch.interested = true)
    jobsearch.save
---
INSERT INTO "jobsearches" ("accepted", "contacted", "contractor_id", "created_at", "dateaccepted", "datecontacted", "datedeclined", "dateinterested", "dateoffered", "daterejected", "declined", "firstsearchposition", "interested", "job_id", "offered", "rejected", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"
SELECT  "jobsearches".* FROM "jobsearches"  WHERE "jobsearches"."contractor_id" = 1 AND "jobsearches"."job_id" = 2 LIMIT 1
UPDATE "jobsearches" SET "interested" = 't', "updated_at" = '2014-12-14 19:14:56.901220' WHERE "jobsearches"."id" = 83

  def put_toggle_contractor_favourite

    relationship = Relationship.where(contractor_id: params[:contractor_id], company_id: params[:company_id]).first_or_create


    relationship.favouritecontractor ? (relationship.favouritecontractor = false) : (relationship.favouritecontractor = true)
    relationship.save
---
SELECT  "relationships".* FROM "relationships"  WHERE "relationships"."contractor_id" = 7 AND "relationships"."company_id" = 1 LIMIT 1
UPDATE "relationships" SET "favouritecontractor" = 't', "updated_at" = '2014-11-15 11:33:47.547621' WHERE "relationships"."id" = 51

  def put_toggle_company_block_contractor

    relationship = Relationship.where(contractor_id: params[:contractor_id], company_id: params[:company_id]).first_or_create


    relationship.companyblockcontractor ? (relationship.companyblockcontractor = false) : (relationship.companyblockcontractor = true)
    relationship.save
---
SELECT  "relationships".* FROM "relationships"  WHERE "relationships"."contractor_id" = 7 AND "relationships"."company_id" = 1 LIMIT 1
UPDATE "relationships" SET "companyblockcontractor" = 't', "updated_at" = '2014-11-15 11:33:45.036157' WHERE "relationships"."id" = 51